[
    {
        "id": "0",
        "name": "SAMSUNG Galaxy S21 Ultra 5G Factory Unlocked Android Cell Phone 128GB US Version Smartphone Pro-Grade Camera 8K Video 108MP High Res, Phantom Black",
        "price": "1,195.99",
        "brand": "Samsung",
        "image_url": "https://m.media-amazon.com/images/I/61O45C5qASL._AC_SX466_.jpg",
        "rating": {
            "major": [
                "*",
                "*",
                "*",
                "*"
            ],
            "minor": [
                "*"
            ]
        },
        "spacifications": {
            "Model Name": "P3",
            "Wireless Carrier": "Unlocked",
            "Brand": "Samsung Electronics",
            "Form Factor": "Smartphone",
            "Memory Storage Capacity": "128 GB",
            "Operating System": "Android"
        },
        "About": [
            "PRO-GRADE CAMERA: Zoom in close with 100X Space Zoom, and take photos and videos like a pro with our easy-to-use, multi-lens camera.",
            "SHARP 8K VIDEO: Capture your life’s best moments in head-turning, super-smooth, cinema quality 8K Video.",
            "MULTIPLE WAYS TO RECORD: Create share-ready videos and GIFs with multi-cam recording and automatic, professional-style effects.",
            "HIGHER RESOLUTION, 100X ZOOM: Get amazing clarity with a dual lens combo of 3X and 10X optical zoom and revolutionary 100X Space Zoom.",
            "ALL DAY INTELLIGENT BATTERY: Intuitively manages your cellphone’s usage, so you can go all day without charging.",
            "POWER OF 5G: Experience next-generation connectivity for everything you love to do: more sharing, more gaming, more experiences.",
            "Battery power consumption depends on usage patterns and results may vary."
        ]
    },
    {
        "id": "1",
        "name": "2020 Apple MacBook Air Laptop: Apple M1 Chip, 13” Retina Display, 8GB RAM, 256GB SSD Storage, Backlit Keyboard, FaceTime HD Camera, Touch ID. Works with iPhone/iPad; Gold",
        "price": "889.00",
        "brand": "Apple",
        "image_url": "https://m.media-amazon.com/images/I/71vFKBpKakL._AC_SX425_.jpg",
        "rating": {
            "major": [
                "*",
                "*",
                "*",
                "*",
                "*"
            ],
            "minor": []
        },
        "spacifications": {
            "Model Name": "MacBook Air",
            "Brand": "Apple",
            "Specific Uses For Product": "Multimedia, Personal, Business",
            "Screen Size": "13.3 Inches",
            "Operating System": "Mac OS",
            "Human Interface Input": "Keyboard",
            "CPU Manufacturer": "Apple",
            "Color": "Gold",
            "Connectivity Technology": "Bluetooth, Wi-Fi",
            "Hard Disk Size": "256 GB"
        },
        "About": [
            "All-Day Battery Life – Go longer than ever with up to 18 hours of battery life.",
            "Powerful Performance – Take on everything from professional-quality editing to action-packed gaming with ease. The Apple M1 chip with an 8-core CPU delivers up to 3.5x faster performance than the previous generation while using way less power.",
            "Superfast Memory – 8GB of unified memory makes your entire system speedy and responsive. That way it can support tasks like memory-hogging multitab browsing and opening a huge graphic file quickly and easily.",
            "Stunning Display – With a 13.3” Retina display, images come alive with new levels of realism. Text is sharp and clear, and colors are more vibrant.",
            "Why Mac – Easy to learn. Easy to set up. Astoundingly powerful. Intuitive. Packed with apps to use right out of the box. Mac is designed to let you work, play, and create like never before.",
            "Simply Compatible – All your existing apps work, including Adobe Creative Cloud, Microsoft 365, and Google Drive. Plus you can use your favorite iPhone and iPad apps directly on macOS. Altogether you’ll have access to the biggest collection of apps ever for Mac. All available on the App Store.",
            "Easy to Learn – If you already have an iPhone, MacBook Air feels familiar from the moment you turn it on. And it works perfectly with all your Apple devices. Use your iPad to extend the workspace of your Mac, answer texts and phone calls directly on your Mac, and more.",
            "Fanless Design – Your MacBook Air stays cool and runs quietly even while tackling intense workloads.",
            "AppleCare – Every Mac comes with a one-year limited warranty and up to 90 days of complimentary technical support. Get AppleCare+ to extend your coverage and reduce the stress and cost of unexpected repairs.",
            "Environmentally Friendly – MacBook Air is made with a 100% recycled aluminum enclosure and uses less energy for a smaller carbon footprint."
        ]
    },
    {
        "id": "2",
        "name": "Marshall Major IV On-Ear Bluetooth Headphone, Black",
        "price": "99.99",
        "brand": "Marshall",
        "image_url": "https://images-na.ssl-images-amazon.com/images/I/71u2kov-lxL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "rating": {
            "major": [
                "*",
                "*",
                "*",
                "*",
                "*"
            ],
            "minor": []
        },
        "spacifications": {
            "Brand": "Marshall",
            "Color": "Black",
            "Connectivity Technology": "Wireless",
            "Model Name": "Major IV",
            "Form Factor": "On Ear"
        },
        "About": [
            "Major IV delivers the signature Marshall sound that you’ve come to expect. Custom-tuned dynamic drivers deliver roaring bass, smooth mids and brilliant treble for a rich, unrivalled sound that you’ll never want to turn off.",
            "80+ solid hours of wireless playtime with quick-charge capability – only 15 minutes of charging will give you 15 hours of listening. These are headphones truly built for the long haul.",
            "Improved ergonomic design means that when you’re deep diving into your music, the tenth hour is as comfortable as the first. Major IV’s ear cushions are softer to the touch and more faithfully fit the shape of your ear.",
            "Major IV can be charged wirelessly, so it’s now easier than ever to charge and go. Spend less time looking for your charger in a mess of wires and more time listening to your music. You will receive a USB-C charging cable in the box. Wireless charging pad is not included",
            "With the multi-directional control knob you can play, pause, skip and adjust the volume of your device, as well as power your headphones on or off. Phone functionality is also included so you can answer, reject or end a call with a few simple clicks.",
            "Major IV combines enhanced usability with classic Marshall elements like the multi-directional control knob, textured black vinyl and the Marshall script for a design that is both iconic and innovative. The new fold clip means that Major IV folds away into an even more compact size, and the ear caps are protected from too much wear and tear.",
            "Major IV features a 3.5 mm socket so a friend can plug in and enjoy your music.",
            "Included components: Major IV Headphones, 3.5mm audio cord, User Manual and legal and safety information, USB-C charging cable"
        ]
    },
    {
        "id": "3",
        "name": "Computer Mice with USB Receiver Adapter for PC, Laptop, Computer (Black, A)",
        "price": "99.99",
        "brand": "Youmymine",
        "image_url": "https://m.media-amazon.com/images/I/51lHFggvkGL._AC_SY450_.jpg",
        "rating": {
            "major": [
                "*",
                "*",
                "*",
                "*"
            ],
            "minor": [
                "*"
            ]
        },
        "spacifications": {
            "Connectivity Technology": "USB",
            "Brand": "Youmymine",
            "Movement Detection Technology": "Optical",
            "Color": "Black",
            "Hand Orientation": "Left, Right"
        },
        "About": [
            "Rechargeable: Built-in rechargeable battery, no need change battery. Special soundless design for the right and left buttons, won’t disturb others.",
            "Wireless Mouse :RF2.4G wireless transmission distance of up to 10m.",
            "Energy Saving: The mouse will be in sleep mode in 8 mins of inactivity. And the LED light can be turned off by the bottom light switch.",
            "Silm & Portable: Perfect for travelling carry and it can be easily put into your laptop bag and ultra-space saving.",
            "Widely Compatibility: Works with Windows 2000/XP/7/8/10/Vista, Mac with USB port or Type C port. Suitable for homes, offices, travel and more."
        ]
    },
    {
        "id": "4",
        "name": "Wireless Gaming Keyboard and Mouse Combo with 87 Key Rainbow LED Backlight Rechargeable 3800mAh Battery Mechanical Feel Anti-ghosting Ergonomic Waterproof RGB Mute Mice for Computer PC Gamer (Black)",
        "price": "35.99",
        "brand": "ZIYOU LANG",
        "image_url": "https://images-na.ssl-images-amazon.com/images/I/81l7MtHU9SL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "rating": {
            "major": [
                "*",
                "*",
                "*",
                "*"
            ],
            "minor": [
                "*"
            ]
        },
        "spacifications": {
            "Color": "Black",
            "Brand": "ZIYOU LANG",
            "Connectivity Technology": "USB",
            "Operating System": "Windows xp, Mac os",
            "Number of Keys": "87"
        },
        "About": [
            "【3 in 1 Rechargeable Keyboard and Mouse Set】This gaming combo includes a compact 87 key keyboard,a cool crack pattern mouse, and an exquisite mouse pad, equipped with large capacity inbuilt battery(Keyboard:3000mAh, Mouse:800mAh), ensure a long lasting battery working time for long-term use, easy to be charged by inserting the USB cable into your computer USB port, avoid to meet the trouble of replacing battery frequently, more convenient.",
            "【2.4Ghz Wireless Connection】This gaming keyboard and mouse combo adopt advanced 2.4Ghz wireless transmission technology, shared one USB receiver, featured with plug and play, can be easily connected by plugging the USB receiver which place in the bottom slot of the mouse into the USB port of the device you want to connect, no need to install any software. Note: Before connecting, pls make sure the keyboard and mouse are turned on.",
            "【Gorgeous Rainbow Backlight】The wireless gaming keyboard can offer cool mixed color backlight effect, 3 level of brightness, more glowing in the dark, provide unique visual feast when using and enhance the competitive atmosphere when gaming, and also you can easily turn the backlight off or on by pressing FN+Scroll key to fit your real needs, and the backlight will auto turn off if no using in 2 minutes to save energy.",
            "【Gaming Mouse】This wireless mouse is designed with cool cracked pattern and 7 color auto changing breathing backlight, 6 buttons, 3 level of adjustable DPI( 800-1600-2400), create a fancy visual experience, make using more flexible and accurate, and it is made of high quality ABS material and ergonomic housing, ensure a comfortable using for a long time without fatigue, it also have light switch to turn on/off the backlight, very practical.",
            "【Wide Compatibility】Ergonomic 87 key layout, save space design, luminous character, removable keycaps, FN key combination, anti-ghosting function, inbuilt rechargeable large capacity battery, dazzling rainbow backlight, plug&play, this wireless keyboard and mouse combo can make the most of the extra space of your desk, perfect for game or daily use, can be compatible with computer mac which support Windows XP, WIN 7/8/10, MAC OS 2.0."
        ]
    },
    {
        "id": "5",
        "name": "Garmin 010-02172-21 Vivoactive 4S, Smaller-Sized GPS Smartwatch, Features Music, Body Energy Monitoring, Animated Workouts, Pulse Ox Sensors, Rose Gold with White Band, 40mm",
        "price": "199.99",
        "image_url": "https://m.media-amazon.com/images/I/51r2LCE3FLL._AC_SL1000_.jpg",
        "brand": "Garmin",
        "rating": {
            "major": [
                "*",
                "*",
                "*",
                "*"
            ],
            "minor": [
                "*"
            ]
        },
        "spacifications": {
            "Brand": "Garmin",
            "Color": "Rose Gold with White Band",
            "Screen Size": "1.1 Inches",
            "Item Dimensions LxWxH": "1.57 x 1.57 x 0.5 inches",
            "Item Weight": "0.08 Pounds",
            "Battery Life": "0.01 seconds"
        },
        "About": [
            "Keeps track of your energy levels, Pulse Ox (this is not a medical device and is not intended for use in the diagnosis or monitoring of any medical condition), respiration, menstrual cycle, stress, sleep, estimated heart, hydration and more",
            "Easily download songs to your watch, including playlists from Spotify, Amazon music or Deezer (may require a premium subscription with a third-party music provider), and connect with headphones (sold separately) for phone-free listening",
            "Record all the ways to move with more than 20 preloaded GPS and indoor sports apps, including yoga, running, swimming and more. Get easy-to-follow, animated workouts right on your watch screen, including strength, cardio, yoga and Pilates",
            "Fits wrists with a circumference of 110-175 millimeter",
            "Battery life: Up to 7 days in smartwatch mode; Up to 5 hours in GPS and music mode",
            "Personalize your watch with thousands of free watch faces, apps and widgets from our Connect IQ store",
            "Garmin Pay contactless payment solution (not all countries and payment Networks are eligible) lets you pay for purchases with your watch"
        ]
    },
    {
        "id": "6",
        "name": "Intel Core i7-10700KF Desktop Processor 8 Cores up to 5.1 GHz Unlocked Without Processor Graphics LGA1200 (Intel 400 Series chipset) 125W",
        "image_url": "https://m.media-amazon.com/images/I/714-1OvyFIL._AC_SX679_.jpg",
        "price": "313.45",
        "brand": "Intel",
        "rating": {
            "major": [
                "*",
                "*",
                "*",
                "*",
                "*"
            ],
            "minor": []
        },
        "spacifications": {
            "Brand": "Intel",
            "CPU Manufacturer": "Intel",
            "CPU Model": "Core i7",
            "CPU Speed": "3.8 GHz",
            "CPU Socket": "LGA 1200"
        },
        "About": [
            "8 Cores / 16 Threads",
            "Socket Type LGA 1200",
            "Up to 5.1 GHz Unlocked",
            "Compatible with Intel 400 series chipset based motherboards",
            "Intel turbo boost max technology 3.0 support",
            "Intel Optane Memory Support. No ECC Memory Supported",
            "Configurable TDP-down 95 W"
        ]
    },
    {
        "id": "7",
        "name": "ASUS ROG Strix B450-F Gaming II AMD AM4 (Ryzen 5000, 3rd Gen Ryzen ATX Gaming Motherboard (8+4 Power Stages, HDMI 2.0b/DP,2 x PCIe 3.0 x16, USB 3.2 Gen 2 Type-C, BIOS Flashback, 256Mb BIOS Flash ROM",
        "image_url": "https://m.media-amazon.com/images/I/91MWQtTH4bL._AC_SX679_.jpg",
        "price": "119.99",
        "brand": "ASUS",
        "rating": {
            "major": [
                "*",
                "*",
                "*",
                "*"
            ],
            "minor": [
                "*"
            ]
        },
        "spacifications": {
            "Brand": "ASUS",
            "CPU Socket": "Socket AM4",
            "RAM Memory Technology": "DDR4",
            "Compatible Processors": "AMD 1st Gerenration Ryzen",
            "Chipset Type": "AMD B450",
            "Platform": "Windows 10",
            "Series": "ROG STRIX B450-F Gaming II",
            "Memory Storage Capacity": "256 MB",
            "Graphics Card Interface": "PCI-E",
            "Memory Slots Available": "4"
        },
        "About": [
            "AMD AM4 Socket: Compatible to Ryzen 5000, 3rd/2nd/1st Gen AMD Ryzen CPUs",
            "Robust Power Design: 8+2 DrMOS power stages with high-quality alloy chokes and durable capacitors provide reliable power for the last AMD high-count-core CPUs",
            "Optimized Thermal Solution: Extended VRM and PCH heatsinks, M.2 heatsinks, multiple hybrid fan headers and fan speed management with Fan Xpert utility",
            "Best Gaming Connectivity: Supports HDMI 2.0b(4K@60HZ) and DisplayPort 1.2 output, featuring dual M.2 slots (NVMe SSD), 2x PCIe 3.0x16 Slot, USB 3.2 Gen 2 Type-A port and USB 3.1 Gen 2 Type-A & Type-C ports",
            "Industry-leading Gaming Audio & AI Noise Canceling Microphone Technology: High fidelity audio from a SupremeFX S1220A codec with DTS Sound Unbound and Sonic Studio III draws you deeper into the action. Communicate clearly with ASUS AI Noise Cancelling Mic technology.",
            "Unmatched Personalization: ASUS-exclusive Aura Sync RGB lighting with Armoury Crate utility, including 2xRGB headers and a Gen 2 addressable RGB header for greater customization",
            "DIY Friendly: With BIOS Flashback and ASUS exclusive UEFI BIOS, 256Mb BIOS Flash ROM and Pre-mount I/O shroud",
            "Please ensure your BIOS is up to date if installing a compatible Ryzen 5000 series CPU. Visit ASUS site search by motherboard model name, click on “Support” tab, Drivers and Tools, then BIOS & Firmware to download the latest BIOS."
        ]
    },
    {
        "id": "8",
        "name": "Corsair Vengeance LPX 16GB (2x8GB) DDR4 DRAM 3200MHz C16 Desktop Memory Kit - Black (CMK16GX4M2B3200C16)",
        "price": "62.99",
        "brand": "Corsair",
        "image_url": "https://m.media-amazon.com/images/I/51XWCgqIUVL._AC_SX679_PIbundle-2,TopRight,0,0_SH20_.jpg",
        "rating": {
            "major": [
                "*",
                "*",
                "*",
                "*",
                "*"
            ],
            "minor": []
        },
        "spacifications": {
            "Brand": "Corsair",
            "Form Factor": "DIMM",
            "RAM Memory Technology": "Ddr4_sdram",
            "Computer Memory Size": "16 GB",
            "Memory Speed": "3200 MHz"
        },
        "About": [
            "Make sure this fits by entering your model number.",
            "Hand-sorted memory chips ensure high performance with generous Overclocking headroom. SPD Speed-2133MHz",
            "Vengeance LPX is optimized for wide compatibility with the latest Intel and AMD DDR4 motherboards.",
            "A low-profile height of just 34mm ensures that vengeance LPX even fits in most small-form-factor builds.",
            "A high-performance PCB guarantees strong signal quality and stability for superior Overclocking ability.",
            "A solid aluminum heatspreader efficiently dissipates heat from each module so that they consistently run at high clock speeds.",
            "Supports Intel XMP 2.0 for simple one-setting installation and setup.",
            "Available in multiple colors to match the style of your system."
        ]
    },
    {
        "id": "9",
        "name": "Badminton Racquet ,Bat，Fostoy Badminton Racket Set-Professional Carbon Fiber Badminton Racket with 3 shuttlecocks and Carrying Bag-Perfect for Adults",
        "image_url": "https://m.media-amazon.com/images/I/81rL16Z1mhL._AC_SL1500_.jpg",
        "price": "10",
        "brand": "Fostoy",
        "rating": {
            "major": [
                "*",
                "*",
                "*",
                "*",
                "*"
            ],
            "minor": []
        },
        "spacifications": {
            "Color": "Red",
            "Brand": "Fostoy",
            "Sport Type": "Badminton",
            "Material": "Carbon Fiber",
            "Skill Level": "Beginner, Professional",
            "Frame Material": "Carbon Fiber",
            "Age Range (Description": "Adult"
        },
        "About": [
            "🏸【EXCELLENT MATERIAL AND BEAUTIFUL PACKAGING】Our badminton racquet is made of full carbon fiber frame, fiber wire, and solid wood handle. Badminton set includes 2 badminton rackets, 3 shuttlecocks, 1 carries bag，and 2 extra tapes for the handles. Badminton racket is long 67cm.",
            "🏸【GREAT FOR PLAYERS OF ANY LEVEL】The badminton racket oval head design increases the effective area of the racket net and expands the spot of the hitting ball. The badminton racquet can maintain good precision and speed. The grip is comfortable and turning is easier.",
            "🏸【PERFECT DESIGNED DETAILS】Our badminton rackets come to you with original high quality by the manufacturer. The racquet is made of good elasticity and high-strength wire hole can better protect the strings, and then extend the longevity.",
            "🏸【PORTABLE BADMINTON RACQUET】Badminton racket middle pole is made of full carbon, increased the badminton racquet rebound and attack power. More stability and lightweight.",
            "🏸【100% SATISFACTION SERVICES】With our badminton racquet, you get a reliable and high-quality badminton sports equipment for on-the-go use. Fostoy provides lifetime money back/replacement service for badminton racket set, so purchase with confidence from us anytime!"
        ]
    },
    {
        "id": "10",
        "name": "SS Kashmir Willow Leather Ball Cricket Bat, Exclusive Cricket Bat for Adult Full Size with Full Protection Cover (Cannon)",
        "image_url": "https://m.media-amazon.com/images/I/71Sf5NwCp0L._AC_SX569_.jpg",
        "price": "49.98",
        "brand": "SS",
        "rating": {
            "major": [
                "*",
                "*",
                "*",
                "*"
            ],
            "minor": [
                "*"
            ]
        },
        "spacifications": {
            "Sport Type": "Cricket",
            "Brand": "SS",
            "Material": "Leather",
            "Item Weight": "1280 Grams",
            "Age Range (Description)": "Adult"
        },
        "About": [
            "SS Kashmir Willow Leather Ball Cricket Bat, Exclusive Cricket Bat for Adult Full Size with Full Protection Cover (Cannon)"
        ]
    }
]